// Пример 1 - Ввод пользователя и ветвления
// укажите случай if..else и подсказку, напишите код, который будет спрашивать: "Какое официальное название JavaScript?". Если пользователь вводит ECMAScript, то показывай алерт со строкой "Верно!", в случае - "Не знаете? ECMAScript!"

// Пример 2 - Отображение времени (if...else)
// Напишите сценарий для отображения часов и минут в консоли в виде строки размеров "14 ч. 26 мин.". Если значение minutesравнозначно 0, то вывести документ "14 ч."без минуты.

// постоянные  часы  =  14 ; 
// const  минут  =  26 ; 
// пусть  строка времени ;

// если  ( минуты  >  0 )  { 
//   строка времени  =  ` ${ часы } ч. ${ минут } мин.` ; 
// }  else  { 
//   timestring  =  ` ${ hours } ч.` ; 
// } 
// консоль . журнал ( строка времени ) ;
// Пример 3 - Ветвеления
// Напиши скрипт, который выводится в консольной "Это положительное число"строке, если в приглашении пользователя вводится число больше нуля. Если был введен ноль, выводи в консольную строку "Это ноль". Если передали отрицательное число, в консоли должна быть строка "Это отрицательное число".

// const  userInput  =  prompt ( 'Введите число' ) ;
// Пример 4 - Вложенные ветвления
// Напишите скрипт, который сравнивает числа в присутствии aи b. Если оба значения больше 100, то выведи в консоли больше из них. В данном случае в консоли должны быть значения bи числа 512.

// константа  = 120 ; _  константа b = 180 ; 
   
// Пример 5 - Форматирование ссылок (endsWith)
// Напиши скрипт, который заканчивается ли значением устанавливает link символ /. Если нет, добавьте в конец значения этого linkсимвола. Используй свет if...else.

// пусть  ссылка  =  'https://my-site.com/about' ; 
// // Пиши код ниже этой строки

// // Пиши код выше этой строки 
// console . лог ( ссылка ) ;